MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
/** @defgroup DAC_LL_EC_OUTPUT_BUFFER DAC channel output buffer
  * @{
  */
/*!< The selected DAC channel output is buffered: higher drive current capability,
     but also higher current consumption */
#define LL_DAC_OUTPUT_BUFFER_ENABLE        0x00000000UL

/*!< The selected DAC channel output is not buffered: lower drive current capability,
     but also lower current consumption */
#define LL_DAC_OUTPUT_BUFFER_DISABLE       (DAC_MCR_MODE1_1)
/**
  * @}
  */

/** @defgroup DAC_LL_EC_OUTPUT_CONNECTION DAC channel output connection
  * @{
  */
/*!< The selected DAC channel output is connected to an external pin.
  Note: Depending on other parameters (normal mode or sample-and-hold mode, output buffer state),
  output can also be connected to on-chip peripherals; refer to the reference manual or
  comments of function @ref LL_DAC_SetOutputConnection(). */
#define LL_DAC_OUTPUT_CONNECT_EXTERNAL     0x00000000UL

/*!< The selected DAC channel output is connected to on-chip peripherals (via internal paths).
  Note: Depending on other parameters (normal mode or sample-and-hold mode, output buffer state),
  output can also be connected to an external pin; refer to the reference manual or
  comments of function @ref LL_DAC_SetOutputConnection(). */
#define LL_DAC_OUTPUT_CONNECT_INTERNAL     (DAC_MCR_MODE1_0)
/**
  * @}
  */

/** @defgroup DAC_LL_EC_SIGNED_FORMAT DAC channel data signed format
  * @{
  */
/*!< The selected DAC channel data format is not signed */
#define LL_DAC_SIGN_FORMAT_UNSIGNED       0x00000000UL
/*!< The selected DAC channel data format is signed */
#define LL_DAC_SIGN_FORMAT_SIGNED        (DAC_MCR_SINFORMAT1)
/**
  * @}
  */

/** @defgroup DAC_LL_EC_RESOLUTION  DAC channel output resolution
  * @{
  */
#define LL_DAC_RESOLUTION_12B              0x00000000UL            /*!< DAC channel resolution 12 bits */
#define LL_DAC_RESOLUTION_8B               0x00000002UL            /*!< DAC channel resolution 8 bits */
/**
  * @}
  */

/** @defgroup DAC_LL_EC_REGISTERS  DAC registers compliant with specific purpose
  * @{
  */
/* List of DAC registers intended to be used (most commonly) with             */
/* DMA transfer.                                                              */
/* Refer to function @ref LL_DAC_DMA_GetRegAddr().                            */

/*!< DAC channel data holding register 12 bits right aligned */
#define LL_DAC_DMA_REG_DATA_12BITS_RIGHT_ALIGNED  DAC_REG_DHR12RX_REGOFFSET_BITOFFSET_POS

/*!< DAC channel data holding register 12 bits left aligned */
#define LL_DAC_DMA_REG_DATA_12BITS_LEFT_ALIGNED   DAC_REG_DHR12LX_REGOFFSET_BITOFFSET_POS

/*!< DAC channel data holding register 8 bits right aligned */
#define LL_DAC_DMA_REG_DATA_8BITS_RIGHT_ALIGNED   DAC_REG_DHR8RX_REGOFFSET_BITOFFSET_POS

/**
  * @}
  */

/** @defgroup DAC_LL_EC_HW_DELAYS  Definitions of DAC hardware constraints delays
  * @note   Only DAC peripheral HW delays are defined in DAC LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for DAC channel voltage settling time at DAC channel startup         */
/* (transition from disabled to enabled).                                     */
/* Note: DAC channel startup time depends on board application environment:   */
/*       impedance connected to DAC channel output.                           */
/*       The delay below is specified under conditions:                       */
/*        - voltage maximum transition (lowest to highest value)              */
/*        - until voltage reaches final value +-1LSB                          */
/*        - DAC channel output buffer enabled                                 */
/*        - load impedance of 5kOhm (min), 50pF (max)                         */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tWAKEUP").                                                      */
/* Unit: us                                                                   */
/*!< Delay for DAC channel voltage settling time at DAC channel startup (transition from disabled to enabled) */
#define LL_DAC_DELAY_STARTUP_VOLTAGE_SETTLING_US             8UL

/* Delay for DAC channel voltage settling time.                               */
/* Note: DAC channel startup time depends on board application environment:   */
/*       impedance connected to DAC channel output.                           */
/*       The delay below is specified under conditions:                       */
/*        - voltage maximum transition (lowest to highest value)              */
/*        - until voltage reaches final value +-1LSB                          */
/*        - DAC channel output buffer enabled                                 */
/*        - load impedance of 5kOhm min, 50pF max                             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSETTLING").                                                    */
/* Unit: us                                                                   */
#define LL_DAC_DELAY_VOLTAGE_SETTLING_US                     3UL /*!< Delay for DAC channel voltage settling time */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DAC_LL_Exported_Macros LL DAC Macros
  * @{
  */

/** @defgroup DAC_LL_EM_WRITE_READ Common write and read registers macros
  * @{
  */

/**
  * @brief  Write a value to a DAC register.
  * @param  instance DAC Instance
  * @param  reg Register to write
  * @param  value Value to write to the register
  */
#define LL_DAC_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value from a DAC register.
  * @param  instance DAC Instance
  * @param  reg Register to read
  * @retval Register value
  */
#define LL_DAC_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)

/**
  * @}
  */

