MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
/** @defgroup DAC_LL_EM_HELPER_MACRO DAC helper macro
  * @{
  */

/**
  * @brief  Helper macro to get DAC channel number in decimal format
  *         from literals LL_DAC_CHANNEL_x.
  *         Example:
  *            LL_DAC_CHANNEL_TO_DECIMAL_NB(LL_DAC_CHANNEL_1) returns decimal number "1".
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @note   The input can be a value from functions where a channel
  *         number is returned.
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval 1...2
  */
#define LL_DAC_CHANNEL_TO_DECIMAL_NB(channel)  ((channel) & DAC_SWTR_CHX_MASK)

/**
  * @brief  Helper macro to get DAC channel in literal format LL_DAC_CHANNEL_x
  *         from number in decimal format.
  *         Example:
  *           LL_DAC_DECIMAL_NB_TO_CHANNEL(1) returns a data equivalent to "LL_DAC_CHANNEL_1".
  * @param  decimal_nb 1...2 (value "2" depending on DAC channel 2 availability)
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#define LL_DAC_DECIMAL_NB_TO_CHANNEL(decimal_nb) \
  (((decimal_nb) == 1UL) \
   ? ( \
       LL_DAC_CHANNEL_1 \
     ) \
   : \
   (((decimal_nb) == 2UL) \
    ? ( \
        LL_DAC_CHANNEL_2 \
      ) \
    : \
    ( \
      0UL \
    ) \
   ) \
  )
#else
#define LL_DAC_DECIMAL_NB_TO_CHANNEL(decimal_nb) \
  (((decimal_nb) == 1UL) \
   ? ( \
       LL_DAC_CHANNEL_1 \
     ) \
   : \
   ( \
     0UL \
   ) \
  )
#endif /* DAC_NB_OF_CHANNEL == 2 */

/**
  * @brief  Helper macro to define the DAC conversion data full-scale digital
  *         value corresponding to the selected DAC resolution.
  * @param  dac_resolution This parameter can be one of the following values:
  *         @arg @ref LL_DAC_RESOLUTION_12B
  *         @arg @ref LL_DAC_RESOLUTION_8B
  * @note   DAC conversion data full-scale corresponds to voltage range
  *         determined by analog voltage references Vref+ and Vref-
  *         (refer to reference manual).
  * @retval DAC conversion data equivalent voltage value (unit: mVolt)
  */
#define LL_DAC_DIGITAL_SCALE(dac_resolution)  ((0x00000FFFUL) >> ((dac_resolution) << 1UL))

/**
  * @brief  Helper macro to calculate the DAC conversion data (unit: digital
  *         value) corresponding to a voltage (unit: mVolt).
  * @param  vrefanalog_voltage Analog reference voltage (unit: mV)
  * @param  dac_voltage Voltage to be generated by DAC channel
  *                         (unit: mVolt).
  * @param  dac_resolution This parameter can be one of the following values:
  *         @arg @ref LL_DAC_RESOLUTION_12B
  *         @arg @ref LL_DAC_RESOLUTION_8B
  * @note   This helper macro is intended to provide input data in voltage
  *         rather than digital value,
  *         to be used with LL DAC functions such as
  *         @ref LL_DAC_ConvertData12RightAligned().
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro LL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @retval DAC conversion data (unit: digital value)
  */
#define LL_DAC_CALC_VOLTAGE_TO_DATA(vrefanalog_voltage, dac_voltage, dac_resolution)  \
  ((dac_voltage) * LL_DAC_DIGITAL_SCALE(dac_resolution) / (vrefanalog_voltage))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup DAC_LL_Exported_Functions LL DAC Functions
  * @{
  */
/** @defgroup DAC_LL_EF_Channel_Configuration Configuration of DAC instance
  * @{
  */
/**
  * @brief  Set the high frequency interface mode for the selected DAC instance.
  * @rmtoll
  *  MCR      HFSEL          LL_DAC_SetHighFrequencyMode
  * @param  dacx DAC instance
  * @param  high_freq_mode This parameter can be one of the following values:
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_DISABLED
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ
  */
__STATIC_INLINE void LL_DAC_SetHighFrequencyMode(DAC_TypeDef *dacx, uint32_t high_freq_mode)
{
  STM32_MODIFY_REG(dacx->MCR, DAC_MCR_HFSEL, high_freq_mode);
}

/**
  * @brief  Get the high frequency interface mode for the selected DAC instance.
  * @rmtoll
  *  MCR      HFSEL          LL_DAC_GetHighFrequencyMode
  * @param  dacx DAC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_DISABLED
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ
  *         @arg @ref LL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ
  */
__STATIC_INLINE uint32_t LL_DAC_GetHighFrequencyMode(const DAC_TypeDef *dacx)
{
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, DAC_MCR_HFSEL));
}
/**
  * @}
  */

/** @defgroup DAC_LL_EF_Configuration Configuration of DAC channels
  * @{
  */

/**
  * @brief  Set the operating mode for the selected DAC channel:
  *         calibration or normal operating mode.
  * @rmtoll
  *  CR       CEN1           LL_DAC_SetMode \n
  *  CR       CEN2           LL_DAC_SetMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  channel_mode This parameter can be one of the following values:
  *         @arg @ref LL_DAC_MODE_NORMAL_OPERATION
  *         @arg @ref LL_DAC_MODE_CALIBRATION
  */
__STATIC_INLINE void LL_DAC_SetMode(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t channel_mode)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_CEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   channel_mode << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

