MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_CEN1,
                   channel_mode);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the operating mode for the selected DAC channel:
  *         calibration or normal operating mode.
  * @rmtoll
  *  CR       CEN1           LL_DAC_GetMode \n
  *  CR       CEN2           LL_DAC_GetMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_MODE_NORMAL_OPERATION
  *         @arg @ref LL_DAC_MODE_CALIBRATION
  */
__STATIC_INLINE uint32_t LL_DAC_GetMode(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_CEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_CEN1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the offset trimming value for the selected DAC channel.
  *         Trimming has an impact when output buffer is enabled
  *         and is intended to replace factory calibration default values.
  * @rmtoll
  *  CCR      OTRIM1         LL_DAC_SetTrimmingValue \n
  *  CCR      OTRIM2         LL_DAC_SetTrimmingValue
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  trimming_value Value between Min_Data=0x00 and Max_Data=0x1F
  */
__STATIC_INLINE void LL_DAC_SetTrimmingValue(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t trimming_value)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CCR,
                   DAC_CCR_OTRIM1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   trimming_value << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->CCR,
                   DAC_CCR_OTRIM1,
                   trimming_value);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the offset trimming value for the selected DAC channel.
  *         Trimming has an impact when output buffer is enabled
  *         and is intended to replace factory calibration default values.
  * @rmtoll
  *  CCR      OTRIM1         LL_DAC_GetTrimmingValue \n
  *  CCR      OTRIM2         LL_DAC_GetTrimmingValue
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Trimming value between Min_Data=0x00 and Max_Data=0x1F.
  */
__STATIC_INLINE uint32_t LL_DAC_GetTrimmingValue(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CCR, DAC_CCR_OTRIM1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->CCR, DAC_CCR_OTRIM1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the conversion trigger source for the selected DAC channel.
  * @rmtoll
  *  CR       TSEL1          LL_DAC_SetTriggerSource \n
  *  CR       TSEL2          LL_DAC_SetTriggerSource
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  trigger_source This parameter can be one of the following values:
  *         @arg @ref LL_DAC_TRIGGER_SOFTWARE
  *         @arg @ref LL_DAC_TRIGGER_TIM1_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM2_TRGO
  *         @arg LL_DAC_TRIGGER_TIM3_TRGO (1)
  *         @arg @ref LL_DAC_TRIGGER_TIM5_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM6_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM7_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM8_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM15_TRGO
  *         @arg LL_DAC_TRIGGER_LPTIM1_OC1 (3)
  *         @arg @ref LL_DAC_TRIGGER_EXTI9
  *         @arg LL_DAC_TRIGGER_TIM20_TRGO (2)
  *         @arg LL_DAC_TRIGGER_PLAY_OUT (2)
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx and STM32C5J1xx/5K1xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available if LPTIMER1 instance is supported
  * @note   For conversion trigger source to be effective, DAC trigger
  *         must be enabled using function @ref LL_DAC_EnableTrigger().
  * @note   To set conversion trigger source, DAC channel must be disabled.
  *         Otherwise, the setting is discarded.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  */
__STATIC_INLINE void LL_DAC_SetTriggerSource(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t trigger_source)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_TSEL1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   trigger_source << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_TSEL1,
                   trigger_source);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the conversion trigger source for the selected DAC channel.
  * @rmtoll
  *  CR       TSEL1          LL_DAC_GetTriggerSource \n
  *  CR       TSEL2          LL_DAC_GetTriggerSource
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   For conversion trigger source to be effective, DAC trigger
  *         must be enabled using function @ref LL_DAC_EnableTrigger().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_TRIGGER_SOFTWARE
  *         @arg @ref LL_DAC_TRIGGER_TIM1_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM2_TRGO
  *         @arg LL_DAC_TRIGGER_TIM3_TRGO (1)
  *         @arg @ref LL_DAC_TRIGGER_TIM5_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM6_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM7_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM8_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_DAC_TRIGGER_TIM15_TRGO
  *         @arg LL_DAC_TRIGGER_LPTIM1_OC1 (3)
  *         @arg @ref LL_DAC_TRIGGER_EXTI9
  *         @arg LL_DAC_TRIGGER_TIM20_TRGO (2)
  *         @arg LL_DAC_TRIGGER_PLAY_OUT (2)
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx and STM32C5J1xx/5K1xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available if LPTIMER1 instance is supported
  */
__STATIC_INLINE uint32_t LL_DAC_GetTriggerSource(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_TSEL1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

