MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_TSEL1));

#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the waveform automatic generation mode
  *         for the selected DAC channel.
  * @rmtoll
  *  CR       WAVE1          LL_DAC_SetWaveAutoGeneration \n
  *  CR       WAVE2          LL_DAC_SetWaveAutoGeneration
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  wave_auto_generation This parameter can be one of the following values:
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_NONE
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_NOISE
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_TRIANGLE
  */
__STATIC_INLINE void LL_DAC_SetWaveAutoGeneration(DAC_TypeDef *dacx, uint32_t dac_channel,
                                                  uint32_t wave_auto_generation)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_WAVE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   wave_auto_generation << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_WAVE1,
                   wave_auto_generation);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the waveform automatic generation mode
  *         for the selected DAC channel.
  * @rmtoll
  *  CR       WAVE1          LL_DAC_GetWaveAutoGeneration \n
  *  CR       WAVE2          LL_DAC_GetWaveAutoGeneration
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_NONE
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_NOISE
  *         @arg @ref LL_DAC_WAVE_AUTO_GENERATION_TRIANGLE
  */
__STATIC_INLINE uint32_t LL_DAC_GetWaveAutoGeneration(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_WAVE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_WAVE1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the noise waveform generation for the selected DAC channel:
  *         Noise mode and parameters LFSR (linear feedback shift register).
  * @rmtoll
  *  CR       MAMP1          LL_DAC_SetWaveNoiseLFSR \n
  *  CR       MAMP2          LL_DAC_SetWaveNoiseLFSR
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  noise_lfsr_mask This parameter can be one of the following values:
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BIT0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS1_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS2_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS3_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS4_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS5_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS6_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS7_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS8_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS9_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS10_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS11_0
  * @note   For wave generation to be effective, DAC channel
  *         wave generation mode must be enabled using
  *         function @ref LL_DAC_SetWaveAutoGeneration().
  * @note   This setting can be set when the selected DAC channel is disabled
  *         (otherwise, the setting operation is ignored).
  */
__STATIC_INLINE void LL_DAC_SetWaveNoiseLFSR(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t noise_lfsr_mask)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_MAMP1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   noise_lfsr_mask << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_MAMP1,
                   noise_lfsr_mask);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the noise waveform generation for the selected DAC channel:
  *         Noise mode and parameters LFSR (linear feedback shift register).
  * @rmtoll
  *  CR       MAMP1          LL_DAC_GetWaveNoiseLFSR \n
  *  CR       MAMP2          LL_DAC_GetWaveNoiseLFSR
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BIT0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS1_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS2_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS3_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS4_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS5_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS6_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS7_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS8_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS9_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS10_0
  *         @arg @ref LL_DAC_NOISE_LFSR_UNMASK_BITS11_0
  */
__STATIC_INLINE uint32_t LL_DAC_GetWaveNoiseLFSR(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_MAMP1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_MAMP1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the triangle waveform generation for the selected DAC channel:
  *         triangle mode and amplitude.
  * @rmtoll
  *  CR       MAMP1          LL_DAC_SetWaveTriangleAmplitude \n
  *  CR       MAMP2          LL_DAC_SetWaveTriangleAmplitude
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  triangle_amplitude This parameter can be one of the following values:
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_1
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_3
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_7
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_15
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_31
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_63
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_127
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_255
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_511
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_1023
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_2047
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_4095
  * @note   For wave generation to be effective, DAC channel
  *         wave generation mode must be enabled using
  *         function @ref LL_DAC_SetWaveAutoGeneration().
  * @note   This setting can be set when the selected DAC channel is disabled
  *         (otherwise, the setting operation is ignored).
  */
__STATIC_INLINE void LL_DAC_SetWaveTriangleAmplitude(DAC_TypeDef *dacx, uint32_t dac_channel,
                                                     uint32_t triangle_amplitude)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_MAMP1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   triangle_amplitude << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

