MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  STM32_MODIFY_REG(dacx->CR,
                   DAC_CR_MAMP1,
                   triangle_amplitude);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the triangle waveform generation for the selected DAC channel:
  *         triangle mode and amplitude.
  * @rmtoll
  *  CR       MAMP1          LL_DAC_GetWaveTriangleAmplitude \n
  *  CR       MAMP2          LL_DAC_GetWaveTriangleAmplitude
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_1
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_3
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_7
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_15
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_31
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_63
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_127
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_255
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_511
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_1023
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_2047
  *         @arg @ref LL_DAC_TRIANGLE_AMPLITUDE_4095
  */
__STATIC_INLINE uint32_t LL_DAC_GetWaveTriangleAmplitude(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_MAMP1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->CR, DAC_CR_MAMP1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the output for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_ConfigOutput \n
  *  CR       MODE2          LL_DAC_ConfigOutput
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  output_mode This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_MODE_NORMAL
  *         @arg @ref LL_DAC_OUTPUT_MODE_SAMPLE_AND_HOLD
  * @param  output_buffer This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_ENABLE
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_DISABLE
  * @param  output_connection This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_EXTERNAL
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_INTERNAL
  * @note   This function set several features:
  *         - mode normal or sample-and-hold
  *         - buffer
  *         - connection to GPIO or internal path.
  *         These features can also be set individually using
  *         dedicated functions:
  *         - @ref LL_DAC_SetOutputBuffer()
  *         - @ref LL_DAC_SetOutputMode()
  *         - @ref LL_DAC_SetOutputConnection()
  * @note   On this STM32 series, output connection depends on output mode
  *         (normal or sample and hold) and output buffer state.
  *         - if output connection is set to internal path and output buffer
  *           is enabled (whatever output mode):
  *           output connection is also connected to GPIO pin
  *           (both connections to GPIO pin and internal path).
  *         - if output connection is set to GPIO pin, output buffer
  *           is disabled, output mode set to sample and hold:
  *           output connection is also connected to internal path
  *           (both connections to GPIO pin and internal path).
  * @note   Mode sample-and-hold requires an external capacitor
  *         to be connected between DAC channel output and ground.
  *         Capacitor value depends on load on DAC channel output and
  *         sample-and-hold timings configured.
  *         As indication, capacitor typical value is 100nF
  *         (refer to device datasheet, parameter "CSH").
  */
__STATIC_INLINE void LL_DAC_ConfigOutput(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t output_mode,
                                         uint32_t output_buffer, uint32_t output_connection)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->MCR,
                   (DAC_MCR_MODE1_2 | DAC_MCR_MODE1_1 | DAC_MCR_MODE1_0) << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   (output_mode | output_buffer | output_connection) << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->MCR,
                   (DAC_MCR_MODE1_2 | DAC_MCR_MODE1_1 | DAC_MCR_MODE1_0),
                   (output_mode | output_buffer | output_connection));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the output mode normal or sample-and-hold
  *         for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_SetOutputMode \n
  *  CR       MODE2          LL_DAC_SetOutputMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  output_mode This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_MODE_NORMAL
  *         @arg @ref LL_DAC_OUTPUT_MODE_SAMPLE_AND_HOLD
  * @note   Mode sample-and-hold requires an external capacitor
  *         to be connected between DAC channel output and ground.
  *         Capacitor value depends on load on DAC channel output and
  *         sample-and-hold timings configured.
  *         As indication, capacitor typical value is 100nF
  *         (refer to device datasheet, parameter "CSH").
  */
__STATIC_INLINE void LL_DAC_SetOutputMode(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t output_mode)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->MCR,
                   DAC_MCR_MODE1_2 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   output_mode << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->MCR,
                   DAC_MCR_MODE1_2,
                   output_mode);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the output mode normal or sample-and-hold for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_GetOutputMode \n
  *  CR       MODE2          LL_DAC_GetOutputMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_MODE_NORMAL
  *         @arg @ref LL_DAC_OUTPUT_MODE_SAMPLE_AND_HOLD
  */
__STATIC_INLINE uint32_t LL_DAC_GetOutputMode(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_2 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_2));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the output buffer for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_SetOutputBuffer \n
  *  CR       MODE2          LL_DAC_SetOutputBuffer
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  output_buffer This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_ENABLE
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_DISABLE
  * @note   On this STM32 series, when buffer is enabled, its offset can be
  *         trimmed: factory calibration default values can be
  *         replaced by user trimming values, using function
  *         @ref LL_DAC_SetTrimmingValue().
  */
__STATIC_INLINE void LL_DAC_SetOutputBuffer(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t output_buffer)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->MCR,
                   (uint32_t)DAC_MCR_MODE1_1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   output_buffer << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->MCR,
                   (uint32_t)DAC_MCR_MODE1_1,
                   output_buffer);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the output buffer state for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_GetOutputBuffer \n
  *  CR       MODE2          LL_DAC_GetOutputBuffer
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_ENABLE
  *         @arg @ref LL_DAC_OUTPUT_BUFFER_DISABLE
  */
__STATIC_INLINE uint32_t LL_DAC_GetOutputBuffer(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

