MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the output connection for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_SetOutputConnection \n
  *  CR       MODE2          LL_DAC_SetOutputConnection
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  output_connection This parameter can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_EXTERNAL
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_INTERNAL
  * @note   On this STM32 series, output connection depends on output mode (normal or
  *         sample and hold) and output buffer state.
  *         - if output connection is set to internal path and output buffer
  *           is enabled (whatever output mode):
  *           output connection is also connected to GPIO pin
  *           (both connections to GPIO pin and internal path).
  *         - if output connection is set to GPIO pin, output buffer
  *           is disabled, output mode set to sample and hold:
  *           output connection is also connected to internal path
  *           (both connections to GPIO pin and internal path).
  */
__STATIC_INLINE void LL_DAC_SetOutputConnection(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t output_connection)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->MCR,
                   (uint32_t)DAC_MCR_MODE1_0 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   output_connection << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->MCR,
                   (uint32_t)DAC_MCR_MODE1_0,
                   output_connection);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the output connection for the selected DAC channel.
  * @rmtoll
  *  CR       MODE1          LL_DAC_GetOutputConnection \n
  *  CR       MODE2          LL_DAC_GetOutputConnection
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   On this STM32 series, output connection depends on output mode (normal or
  *         sample and hold) and output buffer state.
  *         - if output connection is set to internal path and output buffer
  *           is enabled (whatever output mode):
  *           output connection is also connected to GPIO pin
  *           (both connections to GPIO pin and internal path).
  *         - if output connection is set to GPIO pin, output buffer
  *           is disabled, output mode set to sample and hold:
  *           output connection is also connected to internal path
  *           (both connections to GPIO pin and internal path).
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_EXTERNAL
  *         @arg @ref LL_DAC_OUTPUT_CONNECT_INTERNAL
  */
__STATIC_INLINE uint32_t LL_DAC_GetOutputConnection(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_0 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->MCR, (uint32_t)DAC_MCR_MODE1_0));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the sample-and-hold timing for the selected DAC channel:
  *         sample time.
  * @rmtoll
  *  SHSR1    TSAMPLE1       LL_DAC_SetSampleAndHoldSampleTime \n
  *  SHSR2    TSAMPLE2       LL_DAC_SetSampleAndHoldSampleTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  sample_time Value between Min_Data=0x000 and Max_Data=0x3FF
  * @note   Sample time must be set when DAC channel is disabled
  *         or during DAC operation when DAC channel flag BWSTx is reset,
  *         otherwise the setting is ignored.
  *         Check BWSTx flag state using function "LL_DAC_IsActiveFlag_BWSTx()".
  */
__STATIC_INLINE void LL_DAC_SetSampleAndHoldSampleTime(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t sample_time)
{
  __IO uint32_t *preg = DAC_PTR_REG_OFFSET(dacx->SHSR1, (dac_channel >> DAC_REG_SHSRX_REGOFFSET_BITOFFSET_POS)
                                           & DAC_REG_SHSRX_REGOFFSET_MASK_POSBIT0);

  STM32_MODIFY_REG(*preg, DAC_SHSR1_TSAMPLE1, sample_time);
}

/**
  * @brief  Get the sample-and-hold timing for the selected DAC channel:
  *         sample time.
  * @rmtoll
  *  SHSR1    TSAMPLE1       LL_DAC_GetSampleAndHoldSampleTime \n
  *  SHSR2    TSAMPLE2       LL_DAC_GetSampleAndHoldSampleTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Value between Min_Data=0x000 and Max_Data=0x3FF
  */
__STATIC_INLINE uint32_t LL_DAC_GetSampleAndHoldSampleTime(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
  __IO uint32_t const *preg = DAC_PTR_REG_OFFSET(dacx->SHSR1, (dac_channel >> DAC_REG_SHSRX_REGOFFSET_BITOFFSET_POS)
                                                 & DAC_REG_SHSRX_REGOFFSET_MASK_POSBIT0);

  return (uint32_t) STM32_READ_BIT(*preg, DAC_SHSR1_TSAMPLE1);
}

/**
  * @brief  Set the sample-and-hold timing for the selected DAC channel:
  *         hold time.
  * @rmtoll
  *  SHHR     THOLD1         LL_DAC_SetSampleAndHoldHoldTime \n
  *  SHHR     THOLD2         LL_DAC_SetSampleAndHoldHoldTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  hold_time Value between Min_Data=0x000 and Max_Data=0x3FF
  */
__STATIC_INLINE void LL_DAC_SetSampleAndHoldHoldTime(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t hold_time)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->SHHR,
                   DAC_SHHR_THOLD1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   hold_time << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->SHHR,
                   DAC_SHHR_THOLD1,
                   hold_time);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the sample-and-hold timing for the selected DAC channel:
  *         hold time.
  * @rmtoll
  *  SHHR     THOLD1         LL_DAC_GetSampleAndHoldHoldTime \n
  *  SHHR     THOLD2         LL_DAC_GetSampleAndHoldHoldTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Value between Min_Data=0x000 and Max_Data=0x3FF
  */
__STATIC_INLINE uint32_t LL_DAC_GetSampleAndHoldHoldTime(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->SHHR, DAC_SHHR_THOLD1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

