MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  return (uint32_t)(STM32_READ_BIT(dacx->SHHR, DAC_SHHR_THOLD1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the sample-and-hold timing for the selected DAC channel:
  *         refresh time.
  * @rmtoll
  *  SHRR     TREFRESH1      LL_DAC_SetSampleAndHoldRefreshTime \n
  *  SHRR     TREFRESH2      LL_DAC_SetSampleAndHoldRefreshTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  refresh_time Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_DAC_SetSampleAndHoldRefreshTime(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t refresh_time)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->SHRR,
                   DAC_SHRR_TREFRESH1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   refresh_time << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->SHRR,
                   DAC_SHRR_TREFRESH1,
                   refresh_time);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the sample-and-hold timing for the selected DAC channel:
  *         refresh time.
  * @rmtoll
  *  SHRR     TREFRESH1      LL_DAC_GetSampleAndHoldRefreshTime \n
  *  SHRR     TREFRESH2      LL_DAC_GetSampleAndHoldRefreshTime
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_DAC_GetSampleAndHoldRefreshTime(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->SHRR, DAC_SHRR_TREFRESH1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->SHRR, DAC_SHRR_TREFRESH1));
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Set the signed format for the selected DAC channel.
  * @rmtoll
  *  MCR      SINFORMAT1     LL_DAC_SetSignedFormat \n
  *  MCR      SINFORMAT2     LL_DAC_SetSignedFormat
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  signed_format This parameter can be one of the following values:
  *         @arg @ref LL_DAC_SIGN_FORMAT_SIGNED
  *         @arg @ref LL_DAC_SIGN_FORMAT_UNSIGNED
  * @note   With signed format an offset of half the amplitude (0x800) is added because DAC output can provide
  *         only positive value.
  * @note   On this STM32 series, signed format can be used to inject
  *         Q1.15, Q1.11, Q1.7 signed format data to DAC.
  *         Ex when using 12bits data format (Q1.11 is used):
  *             0x800  outputs 0v level
  *             0xFFF  outputs mid-scale level
  *             0x000  outputs mid-scale level
  *             0x7FF  outputs full-scale level
  */
__STATIC_INLINE void LL_DAC_SetSignedFormat(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t signed_format)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_MODIFY_REG(dacx->MCR,
                   DAC_MCR_SINFORMAT1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK),
                   signed_format << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_MODIFY_REG(dacx->MCR,
                   DAC_MCR_SINFORMAT1,
                   signed_format);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get the signed format state for the selected DAC channel.
  * @rmtoll
  *  MCR      SINFORMAT1     LL_DAC_GetSignedFormat \n
  *  MCR      SINFORMAT2     LL_DAC_GetSignedFormat
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DAC_SIGN_FORMAT_SIGNED
  *         @arg @ref LL_DAC_SIGN_FORMAT_UNSIGNED
  */
__STATIC_INLINE uint32_t LL_DAC_GetSignedFormat(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return (uint32_t)(STM32_READ_BIT(dacx->MCR, DAC_MCR_SINFORMAT1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
                    >> (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return (uint32_t)(STM32_READ_BIT(dacx->MCR, DAC_MCR_SINFORMAT1));
#endif /* DAC_NB_OF_CHANNEL */

}

/**
  * @}
  */

/** @defgroup DAC_LL_EF_DMA_Management DMA Management
  * @{
  */

/**
  * @brief  Enable DAC DMA transfer request of the selected channel.
  * @rmtoll
  *  CR       DMAEN1         LL_DAC_EnableDMAReq \n
  *  CR       DMAEN2         LL_DAC_EnableDMAReq
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   To configure DMA source address (peripheral address),
  *         use function @ref LL_DAC_DMA_GetRegAddr().
  */
__STATIC_INLINE void LL_DAC_EnableDMAReq(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_SET_BIT(dacx->CR,
                DAC_CR_DMAEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

