MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  STM32_SET_BIT(dacx->CR,
                DAC_CR_DMAEN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Disable DAC DMA transfer request of the selected channel.
  * @rmtoll
  *  CR       DMAEN1         LL_DAC_DisableDMAReq \n
  *  CR       DMAEN2         LL_DAC_DisableDMAReq
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   To configure DMA source address (peripheral address),
  *         use function @ref LL_DAC_DMA_GetRegAddr().
  */
__STATIC_INLINE void LL_DAC_DisableDMAReq(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_CLEAR_BIT(dacx->CR,
                  DAC_CR_DMAEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_CLEAR_BIT(dacx->CR,
                  DAC_CR_DMAEN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC DMA transfer request state of the selected channel.
  *         (0: DAC DMA transfer request is disabled, 1: DAC DMA transfer request is enabled)
  * @rmtoll
  *  CR       DMAEN1         LL_DAC_IsDMAReqEnabled \n
  *  CR       DMAEN2         LL_DAC_IsDMAReqEnabled
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsDMAReqEnabled(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->CR,
                          DAC_CR_DMAEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (DAC_CR_DMAEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->CR,
                          DAC_CR_DMAEN1)
           == (DAC_CR_DMAEN1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Enable DAC DMA Double data mode of the selected channel.
  * @rmtoll
  *  MCR      DMADOUBLE1     LL_DAC_EnableDMADoubleDataMode \n
  *  MCR      DMADOUBLE2     LL_DAC_EnableDMADoubleDataMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  */
__STATIC_INLINE void LL_DAC_EnableDMADoubleDataMode(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_SET_BIT(dacx->MCR,
                DAC_MCR_DMADOUBLE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_SET_BIT(dacx->MCR,
                DAC_MCR_DMADOUBLE1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Disable DAC DMA Double data mode of the selected channel.
  * @rmtoll
  *  MCR      DMADOUBLE1     LL_DAC_DisableDMADoubleDataMode \n
  *  MCR      DMADOUBLE2     LL_DAC_DisableDMADoubleDataMode
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  */
__STATIC_INLINE void LL_DAC_DisableDMADoubleDataMode(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_CLEAR_BIT(dacx->MCR,
                  DAC_MCR_DMADOUBLE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_CLEAR_BIT(dacx->MCR,
                  DAC_MCR_DMADOUBLE1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC DMA double data mode state of the selected channel.
  *         (0: DAC DMA double data mode is disabled, 1: DAC DMA double data mode is enabled)
  * @rmtoll
  *  MCR      DMADOUBLE1     LL_DAC_IsDMADoubleDataModeEnabled \n
  *  MCR      DMADOUBLE2     LL_DAC_IsDMADoubleDataModeEnabled
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsDMADoubleDataModeEnabled(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->MCR,
                          DAC_MCR_DMADOUBLE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (DAC_MCR_DMADOUBLE1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->MCR,
                          DAC_MCR_DMADOUBLE1)
           == (DAC_MCR_DMADOUBLE1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Function to help to configure DMA transfer to DAC: retrieve the
  *         DAC register address from DAC instance and a list of DAC registers
  *         intended to be used (most commonly) with DMA transfer.
  * @rmtoll
  *  DHR12R1  DACC1DHR       LL_DAC_DMA_GetRegAddr \n
  *  DHR12L1  DACC1DHR       LL_DAC_DMA_GetRegAddr \n
  *  DHR8R1   DACC1DHR       LL_DAC_DMA_GetRegAddr \n
  *  DHR12R2  DACC2DHR       LL_DAC_DMA_GetRegAddr \n
  *  DHR12L2  DACC2DHR       LL_DAC_DMA_GetRegAddr \n
  *  DHR8R2   DACC2DHR       LL_DAC_DMA_GetRegAddr
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  reg_addr This parameter can be one of the following values:
  *         @arg @ref LL_DAC_DMA_REG_DATA_12BITS_RIGHT_ALIGNED
  *         @arg @ref LL_DAC_DMA_REG_DATA_12BITS_LEFT_ALIGNED
  *         @arg @ref LL_DAC_DMA_REG_DATA_8BITS_RIGHT_ALIGNED
  * @note   These DAC registers are data holding registers:
  *         when DAC conversion is requested, DAC generates a DMA transfer
  *         request to have data available in DAC data holding registers.
  * @note   This macro is intended to be used with LL DMA driver, refer to
  *         function "LL_DMA_ConfigAddresses()".
  *         Example:
  *           LL_DMA_ConfigAddresses(DMA1,
  *                                  LL_DMA_CHANNEL_1,
  *                                  (uint32_t)&< array or variable >,
  *                                  LL_DAC_DMA_GetRegAddr(DAC1, LL_DAC_CHANNEL_1,
  *                                  LL_DAC_DMA_REG_DATA_12BITS_RIGHT_ALIGNED),
  *                                  LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
  * @retval DAC register address
  */
__STATIC_INLINE uint32_t LL_DAC_DMA_GetRegAddr(const DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t reg_addr)
{
  /* Retrieve address of reg_addr DHR12Rx, DHR12Lx or DHR8Rx depending on */
  /* DAC channel selected. */
  return ((uint32_t)(DAC_PTR_REG_OFFSET((dacx)->DHR12R1, ((dac_channel >> (reg_addr & 0x1FUL))
                                                          & DAC_REG_DHR_REGOFFSET_MASK_POSBIT0))));
}
/**
  * @}
  */

/** @defgroup DAC_LL_EF_Operation Operation on DAC channels
  * @{
  */

/**
  * @brief  Enable DAC selected channel.
  * @rmtoll
  *  CR       EN1            LL_DAC_Enable \n
  *  CR       EN2            LL_DAC_Enable
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   After enable from off state, DAC channel requires a delay
  *         for output voltage to reach accuracy +/- 1 LSB.
  *         Refer to device datasheet, parameter "tWAKEUP".
  */
__STATIC_INLINE void LL_DAC_Enable(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_SET_BIT(dacx->CR, DAC_CR_EN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

