MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  STM32_SET_BIT(dacx->CR, DAC_CR_EN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Disable DAC selected channel.
  * @rmtoll
  *  CR       EN1            LL_DAC_Disable \n
  *  CR       EN2            LL_DAC_Disable
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  */
__STATIC_INLINE void LL_DAC_Disable(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_CLEAR_BIT(dacx->CR, DAC_CR_EN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_CLEAR_BIT(dacx->CR, DAC_CR_EN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC enable state of the selected channel
  *         (0: DAC channel is disabled, 1: DAC channel is enabled).
  * @rmtoll
  *  CR       EN1            LL_DAC_IsEnabled \n
  *  CR       EN2            LL_DAC_IsEnabled
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsEnabled(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->CR, DAC_CR_EN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (DAC_CR_EN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->CR, DAC_CR_EN1)
           == DAC_CR_EN1) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Enable DAC dual channel.
  * @rmtoll
  *  CR       EN1            LL_DAC_DualChannelEnable \n
  *  CR       EN2            LL_DAC_DualChannelEnable
  * @param  dacx DAC instance
  * @note   After enable from off state, DAC channel requires a delay
  *         for output voltage to reach accuracy +/- 1 LSB.
  *         Refer to device datasheet, parameter "tWAKEUP".
  */
__STATIC_INLINE void LL_DAC_DualChannelEnable(DAC_TypeDef *dacx)
{
  STM32_SET_BIT(dacx->CR, (DAC_CR_EN1 | DAC_CR_EN2));
}

/**
  * @brief  Disable DAC selected DualChan channel.
  * @rmtoll
  *  CR       EN1            LL_DAC_DualChannelDisable \n
  *  CR       EN2            LL_DAC_DualChannelDisable
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_DualChannelDisable(DAC_TypeDef *dacx)
{
  STM32_CLEAR_BIT(dacx->CR, (DAC_CR_EN1 | DAC_CR_EN2));
}
#endif /* DAC_NB_OF_CHANNEL */

/**
  * @brief  Get DAC ready for conversion state of the selected channel
  *         (0: DAC channel is not ready, 1: DAC channel is ready).
  * @rmtoll
  *  SR       DAC1RDY        LL_DAC_IsReady \n
  *  SR       DAC2RDY        LL_DAC_IsReady
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsReady(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->SR,
                          DAC_SR_DAC1RDY << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (DAC_SR_DAC1RDY << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->SR,
                          DAC_SR_DAC1RDY)
           == (DAC_SR_DAC1RDY)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Enable DAC trigger of the selected channel.
  * @rmtoll
  *  CR       TEN1           LL_DAC_EnableTrigger \n
  *  CR       TEN2           LL_DAC_EnableTrigger
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   - If DAC trigger is disabled, DAC conversion is performed
  *           automatically once the data holding register is updated,
  *           using functions "LL_DAC_ConvertData{8; 12}{Right; Left} Aligned()":
  *           @ref LL_DAC_ConvertData12RightAligned(), ...
  *         - If DAC trigger is enabled, DAC conversion is performed
  *           only when a hardware of software trigger event is occurring.
  *           Select trigger source using
  *           function @ref LL_DAC_SetTriggerSource().
  */
__STATIC_INLINE void LL_DAC_EnableTrigger(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_SET_BIT(dacx->CR,
                DAC_CR_TEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_SET_BIT(dacx->CR,
                DAC_CR_TEN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Disable DAC trigger of the selected channel.
  * @rmtoll
  *  CR       TEN1           LL_DAC_DisableTrigger \n
  *  CR       TEN2           LL_DAC_DisableTrigger
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  */
__STATIC_INLINE void LL_DAC_DisableTrigger(DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  STM32_CLEAR_BIT(dacx->CR,
                  DAC_CR_TEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK));
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  STM32_CLEAR_BIT(dacx->CR,
                  DAC_CR_TEN1);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC trigger state of the selected channel.
  *         (0: DAC trigger is disabled, 1: DAC trigger is enabled)
  * @rmtoll
  *  CR       TEN1           LL_DAC_IsTriggerEnabled \n
  *  CR       TEN2           LL_DAC_IsTriggerEnabled
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsTriggerEnabled(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->CR,
                          DAC_CR_TEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (DAC_CR_TEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->CR,
                          DAC_CR_TEN1)
           == (DAC_CR_TEN1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC software trigger state of the selected channel.
  *         (0: DAC software trigger is disabled, 1: DAC software trigger is enabled)
  * @rmtoll
  *  CR       TEN1           LL_DAC_IsTriggerSWEnabled \n
  *  CR       TEN2           LL_DAC_IsTriggerSWEnabled
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval Software trigger enabled (1) or disabled (0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsTriggerSWEnabled(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((((STM32_READ_REG(dacx->CR)) & ((DAC_CR_TEN1 | DAC_CR_TSEL1) << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK)))
           == (DAC_CR_TEN1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((((STM32_READ_REG(dacx->CR)) & (DAC_CR_TEN1 | DAC_CR_TSEL1))
           == (DAC_CR_TEN1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Trig DAC conversion by software for the selected DAC channel.
  * @rmtoll
  *  SWTRGR  SWTRIG1        LL_DAC_TrigSWConversion \n
  *  SWTRGR  SWTRIG2        LL_DAC_TrigSWConversion
  * @param  dacx DAC instance
  * @param  dac_channel  This parameter can a combination of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   Preliminarily, DAC trigger must be set to software trigger
  *         using function
  *           @ref LL_DAC_SetTriggerSource()
  *         with parameter "LL_DAC_TRIGGER_SOFTWARE".
  *         and DAC trigger must be enabled using
  *         function @ref LL_DAC_EnableTrigger().
  * @note   For devices featuring DAC with 2 channels: this function
  *         can perform a SW start of both DAC channels simultaneously.
  *         Two channels can be selected as parameter.
  *         Example: (LL_DAC_CHANNEL_1 | LL_DAC_CHANNEL_2)
  */
__STATIC_INLINE void LL_DAC_TrigSWConversion(DAC_TypeDef *dacx, uint32_t dac_channel)
{
  STM32_SET_BIT(dacx->SWTRGR,
                (dac_channel & DAC_SWTR_CHX_MASK));
}

/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 12 bits left alignment (LSB aligned on bit 0),
  *         for the selected DAC channel.
  * @rmtoll
  *  DHR12R1  DACC1DHR       LL_DAC_ConvertData12RightAligned \n
  *  DHR12R2  DACC2DHR       LL_DAC_ConvertData12RightAligned
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  data Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE void LL_DAC_ConvertData12RightAligned(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t data)
{
  __IO uint32_t *preg = DAC_PTR_REG_OFFSET(dacx->DHR12R1, (dac_channel >> DAC_REG_DHR12RX_REGOFFSET_BITOFFSET_POS)
                                           & DAC_REG_DHR_REGOFFSET_MASK_POSBIT0);

  STM32_MODIFY_REG(*preg, DAC_DHR12R1_DACC1DHR, data);
}

/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 12 bits left alignment (MSB aligned on bit 15),
  *         for the selected DAC channel.
  * @rmtoll
  *  DHR12L1  DACC1DHR       LL_DAC_ConvertData12LeftAligned \n
  *  DHR12L2  DACC2DHR       LL_DAC_ConvertData12LeftAligned
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  data Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE void LL_DAC_ConvertData12LeftAligned(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t data)
{
  __IO uint32_t *preg = DAC_PTR_REG_OFFSET(dacx->DHR12R1, (dac_channel >> DAC_REG_DHR12LX_REGOFFSET_BITOFFSET_POS)
                                           & DAC_REG_DHR_REGOFFSET_MASK_POSBIT0);

  STM32_MODIFY_REG(*preg, DAC_DHR12L1_DACC1DHR, data);
}

/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 8 bits left alignment (LSB aligned on bit 0),
  *         for the selected DAC channel.
  * @rmtoll
  *  DHR8R1   DACC1DHR       LL_DAC_ConvertData8RightAligned \n
  *  DHR8R2   DACC2DHR       LL_DAC_ConvertData8RightAligned
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @param  data Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_DAC_ConvertData8RightAligned(DAC_TypeDef *dacx, uint32_t dac_channel, uint32_t data)
{
  __IO uint32_t *preg = DAC_PTR_REG_OFFSET(dacx->DHR12R1, (dac_channel >> DAC_REG_DHR8RX_REGOFFSET_BITOFFSET_POS)
                                           & DAC_REG_DHR_REGOFFSET_MASK_POSBIT0);

  STM32_MODIFY_REG(*preg, DAC_DHR8R1_DACC1DHR, data);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 12 bits left alignment (LSB aligned on bit 0),
  *         for both DAC channels.
  * @rmtoll
  *  DHR12RD  DACC1DHR       LL_DAC_ConvertDualData12RightAligned \n
  *  DHR12RD  DACC2DHR       LL_DAC_ConvertDualData12RightAligned
  * @param  dacx DAC instance
  * @param  data_channel1 Value between Min_Data=0x000 and Max_Data=0xFFF
  * @param  data_channel2 Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE void LL_DAC_ConvertDualData12RightAligned(DAC_TypeDef *dacx, uint32_t data_channel1,
                                                          uint32_t data_channel2)
{
  STM32_MODIFY_REG(dacx->DHR12RD,
                   (DAC_DHR12RD_DACC2DHR | DAC_DHR12RD_DACC1DHR),
                   ((data_channel2 << DAC_DHR12RD_DACC2DHR_BITOFFSET_POS) | data_channel1));
}

/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 12 bits left alignment (MSB aligned on bit 15),
  *         for both DAC channels.
  * @rmtoll
  *  DHR12LD  DACC1DHR       LL_DAC_ConvertDualData12LeftAligned \n
  *  DHR12LD  DACC2DHR       LL_DAC_ConvertDualData12LeftAligned
  * @param  dacx DAC instance
  * @param  data_channel1 Value between Min_Data=0x000 and Max_Data=0xFFF
  * @param  data_channel2 Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE void LL_DAC_ConvertDualData12LeftAligned(DAC_TypeDef *dacx, uint32_t data_channel1,
                                                         uint32_t data_channel2)
{
  /* Note: The DAC channel 2 shift value is reduced by 4 because the data is  */
  /*       16 bits and the DAC channel 2 bit field is in the 12 MSBs.         */
  /*       The 4 LSBs must be taken into account for the shift value.             */
  STM32_MODIFY_REG(dacx->DHR12LD,
                   (DAC_DHR12LD_DACC2DHR | DAC_DHR12LD_DACC1DHR),
                   ((data_channel2 << (DAC_DHR12LD_DACC2DHR_BITOFFSET_POS - 4U)) | data_channel1));
}

/**
  * @brief  Set the data to be loaded in the data holding register
  *         in format 8 bits left alignment (LSB aligned on bit 0),
  *         for both DAC channels.
  * @rmtoll
  *  DHR8RD  DACC1DHR       LL_DAC_ConvertDualData8RightAligned \n
  *  DHR8RD  DACC2DHR       LL_DAC_ConvertDualData8RightAligned
  * @param  dacx DAC instance
  * @param  data_channel1 Value between Min_Data=0x00 and Max_Data=0xFF
  * @param  data_channel2 Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_DAC_ConvertDualData8RightAligned(DAC_TypeDef *dacx, uint32_t data_channel1,
                                                         uint32_t data_channel2)
{
  STM32_MODIFY_REG(dacx->DHR8RD,
                   (DAC_DHR8RD_DACC2DHR | DAC_DHR8RD_DACC1DHR),
                   ((data_channel2 << DAC_DHR8RD_DACC2DHR_BITOFFSET_POS) | data_channel1));
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Retrieve output data currently generated for the selected DAC channel.
  * @rmtoll
  *  DOR1     DACC1DOR       LL_DAC_RetrieveOutputData \n
  *  DOR2     DACC2DOR       LL_DAC_RetrieveOutputData
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @note   Whatever alignment and resolution settings
  *         (using functions "LL_DAC_ConvertData{8; 12}{Right; Left} Aligned()":
  *         @ref LL_DAC_ConvertData12RightAligned(), ...),
  *         output data format is 12 bits right aligned (LSB aligned on bit 0).
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_DAC_RetrieveOutputData(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
  __IO uint32_t const *preg = DAC_PTR_REG_OFFSET(dacx->DOR1, (dac_channel >> DAC_REG_DORX_REGOFFSET_BITOFFSET_POS)
                                                 & DAC_REG_DORX_REGOFFSET_MASK_POSBIT0);

