MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dac.h
  return (uint16_t) STM32_READ_BIT(*preg, DAC_DOR1_DACC1DOR);
}

/**
  * @}
  */

/** @defgroup DAC_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Get DAC calibration offset flag for DAC channel 1.
  * @rmtoll
  *  SR       CAL_FLAG1      LL_DAC_IsActiveFlag_CAL1
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_CAL1(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_CAL1) == (LL_DAC_FLAG_CAL1)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Get DAC calibration offset flag for DAC channel 2.
  * @rmtoll
  *  SR       CAL_FLAG2      LL_DAC_IsActiveFlag_CAL2
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_CAL2(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_CAL2) == (LL_DAC_FLAG_CAL2)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Get DAC calibration offset flag for DAC channel.
  * @rmtoll
  *  SR       CAL_FLAG1       LL_DAC_IsActiveFlag_CAL
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_CAL(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_CAL1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (LL_DAC_FLAG_CAL1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_CAL1)
           == (LL_DAC_FLAG_CAL1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC busy writing sample time flag for DAC channel 1.
  * @rmtoll
  *  SR       BWST1          LL_DAC_IsActiveFlag_BWST1
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_BWST1(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_BWST1) == (LL_DAC_FLAG_BWST1)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Get DAC busy writing sample time flag for DAC channel 2.
  * @rmtoll
  *  SR       BWST2          LL_DAC_IsActiveFlag_BWST2
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_BWST2(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_BWST2) == (LL_DAC_FLAG_BWST2)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Get DAC busy writing sample time flag for DAC channel.
  * @rmtoll
  *  SR       BWST1       LL_DAC_IsActiveFlag_BWST
  * @param  dacx DAC instance
  * @param  dac_channel This parameter can be one of the following values:
  *         @arg @ref LL_DAC_CHANNEL_1
  * @if LL_DAC_CHANNEL_2
  *         @arg @ref LL_DAC_CHANNEL_2
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_BWST(const DAC_TypeDef *dacx, uint32_t dac_channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_BWST1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))
           == (LL_DAC_FLAG_BWST1 << (dac_channel & DAC_CR_CHX_BITOFFSET_MASK))) ? 1UL : 0UL);
#else
  /* Prevent unused argument(s) compilation warning */
  (void)dac_channel;

  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_BWST1)
           == (LL_DAC_FLAG_BWST1)) ? 1UL : 0UL);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Get DAC ready status flag for DAC channel 1.
  * @rmtoll
  *  SR       DAC1RDY        LL_DAC_IsActiveFlag_DAC1RDY
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DAC1RDY(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DAC1RDY) == (LL_DAC_FLAG_DAC1RDY)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)

/**
  * @brief  Get DAC ready status flag for DAC channel 2.
  * @rmtoll
  *  SR       DAC2RDY        LL_DAC_IsActiveFlag_DAC2RDY
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DAC2RDY(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DAC2RDY) == (LL_DAC_FLAG_DAC2RDY)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Get DAC output register status flag for DAC channel 1.
  * @rmtoll
  *  SR       DORSTAT1       LL_DAC_IsActiveFlag_DORSTAT1
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DORSTAT1(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DORSTAT1) == (LL_DAC_FLAG_DORSTAT1)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Get DAC output register status flag for DAC channel 2.
  * @rmtoll
  *  SR       DORSTAT2       LL_DAC_IsActiveFlag_DORSTAT2
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DORSTAT2(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DORSTAT2) == (LL_DAC_FLAG_DORSTAT2)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Get DAC underrun flag for DAC channel x.
  * @rmtoll
  *  SR       SR        LL_DAC_IsActiveFlag_DMAUDR
  * @param  dacx DAC instance
  * @param  flag  This parameter can be one of the following values:
  *         @arg @ref LL_DAC_FLAG_DMAUDR1
  *         @arg @ref LL_DAC_FLAG_DMAUDR2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DMAUDR(const DAC_TypeDef *dacx, uint32_t flag)
{
  return ((STM32_READ_BIT(dacx->SR, flag) == (flag)) ? 1UL : 0UL);
}

/**
  * @brief  Get DAC underrun flag for DAC channel 1.
  * @rmtoll
  *  SR       DMAUDR1        LL_DAC_IsActiveFlag_DMAUDR1
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DMAUDR1(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DMAUDR1) == (LL_DAC_FLAG_DMAUDR1)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Get DAC underrun flag for DAC channel 2.
  * @rmtoll
  *  SR       DMAUDR2        LL_DAC_IsActiveFlag_DMAUDR2
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsActiveFlag_DMAUDR2(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->SR, LL_DAC_FLAG_DMAUDR2) == (LL_DAC_FLAG_DMAUDR2)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Clear some bits in DAC status register.
  * @rmtoll
  *  SR       DMAUDRx     LL_DAC_ClearFlag_DMAUDR
  * @param  dacx DAC instance
  * @param  flag  (bit at 1 to be reset) can be LL_DAC_FLAG_DMAUDR1 or LL_DAC_FLAG_DMAUDR2
  * @note   DMAUDRx can be DMAUDR1 or DMAUDR2
  */
__STATIC_INLINE void LL_DAC_ClearFlag_DMAUDR(DAC_TypeDef *dacx, uint32_t flag)
{
  STM32_SET_BIT(dacx->SR, flag);
}

/**
  * @brief  Clear DAC underrun flag for DAC channel 1.
  * @rmtoll
  *  SR       DMAUDR1        LL_DAC_ClearFlag_DMAUDR1
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_ClearFlag_DMAUDR1(DAC_TypeDef *dacx)
{
  STM32_SET_BIT(dacx->SR, LL_DAC_FLAG_DMAUDR1);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Clear DAC underrun flag for DAC channel 2.
  * @rmtoll
  *  SR       DMAUDR2        LL_DAC_ClearFlag_DMAUDR2
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_ClearFlag_DMAUDR2(DAC_TypeDef *dacx)
{
  STM32_SET_BIT(dacx->SR, LL_DAC_FLAG_DMAUDR2);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @}
  */

/** @defgroup DAC_LL_EF_IT_Management IT management
  * @{
  */

/**
  * @brief  Enable DMA "mask" interrupt (choice of channel is contained in mask).
  * @rmtoll
  *  CR       mask      LL_DAC_EnableIT_DMAUDR
  * @param  dacx DAC instance
  * @param  mask interrupt mask that specifies the DAC interrupt.
  *         This parameter can be any combination of the following values:
  *         LL_DAC_IT_DMAUDRIE1 :  DAC channel 1 DMA underrun interrupt
  *         LL_DAC_IT_DMAUDRIE2 :  DAC channel 2 DMA underrun interrupt
  */
__STATIC_INLINE void LL_DAC_EnableIT_DMAUDR(DAC_TypeDef *dacx, uint32_t mask)
{
  STM32_SET_BIT(dacx->CR, mask);
}

/**
  * @brief  Disable DMA "mask"  interrupt (choice of channel is contained in mask).
  * @rmtoll
  *  CR       mask      LL_DAC_DisableIT_DMAUDR
  * @param  dacx DAC instance
  * @param  mask interrupt mask that specifies the DAC interrupt.
  *         This parameter can be any combination of the following values:
  *         LL_DAC_IT_DMAUDRIE1 :  DAC channel 1 DMA underrun interrupt
  *         LL_DAC_IT_DMAUDRIE2 :  DAC channel 2 DMA underrun interrupt
  */
__STATIC_INLINE void LL_DAC_DisableIT_DMAUDR(DAC_TypeDef *dacx, uint32_t mask)
{
  STM32_CLEAR_BIT(dacx->CR, mask);
}

/**
  * @brief  Enable DMA underrun interrupt for DAC channel 1.
  * @rmtoll
  *  CR       DMAUDRIE1      LL_DAC_EnableIT_DMAUDR1
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_EnableIT_DMAUDR1(DAC_TypeDef *dacx)
{
  STM32_SET_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE1);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Enable DMA underrun interrupt for DAC channel 2.
  * @rmtoll
  *  CR       DMAUDRIE2      LL_DAC_EnableIT_DMAUDR2
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_EnableIT_DMAUDR2(DAC_TypeDef *dacx)
{
  STM32_SET_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE2);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Disable DMA underrun interrupt for DAC channel 1.
  * @rmtoll
  *  CR       DMAUDRIE1      LL_DAC_DisableIT_DMAUDR1
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_DisableIT_DMAUDR1(DAC_TypeDef *dacx)
{
  STM32_CLEAR_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE1);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Disable DMA underrun interrupt for DAC channel 2.
  * @rmtoll
  *  CR       DMAUDRIE2      LL_DAC_DisableIT_DMAUDR2
  * @param  dacx DAC instance
  */
__STATIC_INLINE void LL_DAC_DisableIT_DMAUDR2(DAC_TypeDef *dacx)
{
  STM32_CLEAR_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE2);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Get a specific peripheral interrupt status.
  * @rmtoll
  *  CR       DMAUDRIEx      LL_DAC_IsEnabledIT_DMAUDR
  * @param  dacx DAC instance
  * @param  mask interrupt mask that specifies the DAC interrupt.
  *         This parameter can be any combination of the following values:
  *         LL_DAC_IT_DMAUDRIE1 :  DAC channel 1 DMA underrun interrupt
  *         LL_DAC_IT_DMAUDRIE2 :  DAC channel 2 DMA underrun interrupt
  * @retval State of mask (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsEnabledIT_DMAUDR(const DAC_TypeDef *dacx, uint32_t mask)
{
  return ((STM32_READ_BIT(dacx->CR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Get DMA underrun interrupt for DAC channel 1.
  * @rmtoll
  *  CR       DMAUDRIE1      LL_DAC_IsEnabledIT_DMAUDR1
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsEnabledIT_DMAUDR1(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE1) == (LL_DAC_IT_DMAUDRIE1)) ? 1UL : 0UL);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/**
  * @brief  Get DMA underrun interrupt for DAC channel 2.
  * @rmtoll
  *  CR       DMAUDRIE2      LL_DAC_IsEnabledIT_DMAUDR2
  * @param  dacx DAC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DAC_IsEnabledIT_DMAUDR2(const DAC_TypeDef *dacx)
{
  return ((STM32_READ_BIT(dacx->CR, LL_DAC_IT_DMAUDRIE2) == (LL_DAC_IT_DMAUDRIE2)) ? 1UL : 0UL);
}

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAC1 || DAC2 */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_DAC_H */

